# Cap 6 Carregamentos de dados, armazenamento e formatos de arquivos

## 6.1 Leitura e escrita de dados no formato texto

In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv("examples/ex1.csv")

In [4]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
# Arquivos sem cabeçalho
pd.read_csv("examples/ex2.csv", header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [6]:
pd.read_csv("examples/ex2.csv", names=["a", "b", "c", "d", "message"])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [7]:
names = ["a", "b", "c", "d", "message"]

In [8]:
# Parâmetro index_col
pd.read_csv("examples/ex2.csv", names=names, index_col="message")

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [9]:
parsed = pd.read_csv("examples/csv_mindex.csv", index_col=["key1", "key2"])

In [10]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [11]:
# Expressão regular com o parâmetro sep
result = pd.read_csv("examples/ex3.txt", sep="\s+")

In [12]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [13]:
# Parâmetro skiprows
pd.read_csv("examples/ex4.csv", skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [14]:
result = pd.read_csv("examples/ex5.csv")

In [15]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [16]:
pd.isna(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [17]:
# Parâmetro na_values
result = pd.read_csv("examples/ex5.csv", na_values=["NULL"])

In [18]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [19]:
# Parâmetro keep_default_na
result2 = pd.read_csv("examples/ex5.csv", keep_default_na=False)

In [20]:
result2

  something  a   b   c   d message
0       one  1   2   3   4      NA
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [21]:
result2.isna()

   something      a      b      c      d  message
0      False  False  False  False  False    False
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [22]:
result3 = pd.read_csv(
    "examples/ex5.csv", keep_default_na=False, na_values=["NA"]
)

In [23]:
result3

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [24]:
result3.isna()

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [25]:
sentinels = {"message": ["foo", "NA"], "something": ["two"]}

In [26]:
pd.read_csv("examples/ex5.csv", na_values=sentinels, keep_default_na=False)

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       NaN  5   6       8   world
2     three  9  10  11  12     NaN

### Leitura de arquivos de texto por partes

In [27]:
pd.options.display.max_rows = 10

In [28]:
result = pd.read_csv("examples/ex6.csv")

In [29]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [30]:
# Parâmetro nrows
pd.read_csv("examples/ex6.csv", nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [31]:
# Parâmetro chunksize
chunker = pd.read_csv("examples/ex6.csv", chunksize=1000)

In [32]:
type(chunker)

pandas.io.parsers.readers.TextFileReader

In [33]:
tot = pd.Series([], dtype="int64")
for piece in chunker:
    tot = tot.add(piece["key"].value_counts(), fill_value=0)

tot = tot.sort_values(ascending=False)

In [34]:
tot[:10]

key
E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

### Gravação de dados em formato texto

In [35]:
data = pd.read_csv("examples/ex5.csv")

In [36]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [37]:
data.to_csv("examples/out.csv")

In [38]:
import sys

In [39]:
data.to_csv(sys.stdout, sep="|")

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [40]:
data.to_csv(sys.stdout, na_rep="NULL")

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [41]:
# Omitir os rótulos das linhas e colunas
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [42]:
data.to_csv(sys.stdout, index=False, columns=["a", "b", "c"])

a,b,c
1,2,3.0
5,6,
9,10,11.0

### Trabalhando com outros formatos delimitados

In [43]:
import csv

In [44]:
f = open("examples/ex7.csv")

In [45]:
reader = csv.reader(f)

In [46]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [47]:
f.close()

In [48]:
with open("examples/ex7.csv") as f:
    lines = list(csv.reader(f))

In [49]:
header, values = lines[0], lines[1:]

In [50]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [51]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [52]:
class MyDialect(csv.Dialect):
    lineterminator = "\n"
    delimiter = ";"
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

In [53]:
with open("mydata.csv", "w") as f:
    writer = csv.writer(f, dialect=MyDialect)
    writer.writerow(("one", "two", "three"))
    writer.writerow(("1", "2", "3"))
    writer.writerow(("4", "5", "6"))
    writer.writerow(("7", "8", "9"))

### Dados JSON

In [54]:
obj = """
{"name": "Wes",
    "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"],
    "pet": null,
    "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]},
                {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]
    
}
"""

In [55]:
import json

In [56]:
result = json.loads(obj)

In [57]:
result

{'name': 'Wes',
 'cities_lived': ['Akron', 'Nashville', 'New York', 'San Francisco'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
  {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]}

In [58]:
asjson = json.dumps(result)

In [59]:
asjson

'{"name": "Wes", "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"], "pet": null, "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]}, {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]}'

In [60]:
siblings = pd.DataFrame(result["siblings"], columns=["name", "age"])

In [61]:
siblings

    name  age
0  Scott   34
1  Katie   42

In [62]:
data = pd.read_json("examples/example.json")

In [63]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [64]:
data.to_json(sys.stdout)

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [65]:
data.to_json(sys.stdout, orient="records")

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

### XML E HTML: web scraping

In [66]:
tables = pd.read_html("examples/fdic_failed_bank_list.html")

In [67]:
len(tables)

1

In [68]:
failures = tables[0]

In [69]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [70]:
close_timestamps = pd.to_datetime(failures["Closing Date"])

In [71]:
close_timestamps.dt.year.value_counts()

Closing Date
2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: count, Length: 15, dtype: int64

#### Parsing de XML com lxml.objectify

In [72]:
from lxml import objectify

In [73]:
path = "datasets/mta_perf/Performance_MNR.xml"

In [74]:
with open(path) as f:
    parsed = objectify.parse(f)

In [75]:
root = parsed.getroot()

In [76]:
data = []

skip_fields = [
    "PARENT_SEQ",
    "INDICATOR_SEQ",
    "DESIRED_CHANGE",
    "DECIMAL_PLACES",
]

for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [77]:
perf = pd.DataFrame(data)

In [78]:
perf.head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95.0,96.9,95.0,96.9
1,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,%,95.0,96.0,95.0,95.0
2,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,%,95.0,96.3,95.0,96.9
3,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,%,95.0,96.8,95.0,98.3
4,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,%,95.0,96.6,95.0,95.8

In [79]:
perf2 = pd.read_xml(path)

In [80]:
perf2.head()

,INDICATOR_SEQ,PARENT_SEQ,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,DESIRED_CHANGE,INDICATOR_UNIT,DECIMAL_PLACES,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,U,%,1,95.00,96.90,95.00,96.90
1,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,U,%,1,95.00,96.00,95.00,95.00
2,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,U,%,1,95.00,96.30,95.00,96.90
3,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,U,%,1,95.00,96.80,95.00,98.30
4,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,U,%,1,95.00,96.60,95.00,95.80

## 6.2 Formatos de dados binários

In [81]:
frame = pd.read_csv("examples/ex1.csv")

In [82]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [83]:
frame.to_pickle("examples/frame_pickle")

In [84]:
pd.read_pickle("examples/frame_pickle")

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [85]:
fec = pd.read_parquet("datasets/fec/fec.parquet")

In [86]:
fec

,cmte_id,cand_id,cand_nm,contbr_nm,contbr_city,contbr_st,contbr_zip,contbr_employer,contbr_occupation,contb_receipt_amt,contb_receipt_dt,receipt_desc,memo_cd,memo_text,form_tp,file_num
0,C00410118,P20002978,"Bachmann, Michelle","HARVEY, WILLIAM",MOBILE,AL,366010290,RETIRED,RETIRED,250.0,20-JUN-11,None,None,None,SA17A,736166
1,C00410118,P20002978,"Bachmann, Michelle","HARVEY, WILLIAM",MOBILE,AL,366010290,RETIRED,RETIRED,50.0,23-JUN-11,None,None,None,SA17A,736166
2,C00410118,P20002978,"Bachmann, Michelle","SMITH, LANIER",LANETT,AL,368633403,INFORMATION REQUESTED,INFORMATION REQUESTED,250.0,05-JUL-11,None,None,None,SA17A,749073
3,C00410118,P20002978,"Bachmann, Michelle","BLEVINS, DARONDA",PIGGOTT,AR,724548253,NONE,RETIRED,250.0,01-AUG-11,None,None,None,SA17A,749073
4,C00410118,P20002978,"Bachmann, Michelle","WARDENBURG, HAROLD",HOT SPRINGS NATION,AR,719016467,NONE,RETIRED,300.0,20-JUN-11,None,None,None,SA17A,736166
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1001726,C00500587,P20003281,"Perry, Rick","GORMAN, CHRIS D. MR.",INFO REQUESTED,XX,99999,INFORMATION REQUESTED PER BEST EFFORTS,INFORMATION REQUESTED PER BEST EFFORTS,5000.0,29-SEP-11,REATTRIBUTION / REDESIGNATION REQUESTED (AUTOM...,None,REATTRIBUTION / REDESIGNATION REQUESTED (AUTOM...,SA17A,751678
1001727,C00500587,P20003281,"Perry, Rick","DUFFY, DAVID A. MR.",INFO REQUESTED,XX,99999,DUFFY EQUIPMENT COMPANY INC.,BUSINESS OWNER,2500.0,30-SEP-11,None,None,None,SA17A,751678
1001728,C00500587,P20003281,"Perry, Rick","GRANE, BRYAN F. MR.",INFO REQUESTED,XX,99999,INFORMATION REQUESTED PER BEST EFFORTS,INFORMATION REQUESTED PER BEST EFFORTS,500.0,29-SEP-11,None,None,None,SA17A,751678
1001729,C00500587,P20003281,"Perry, Rick","TOLBERT, DARYL MR.",INFO REQUESTED,XX,99999,T.A.C.C.,LONGWALL MAINTENANCE FOREMAN,500.0,30-SEP-11,None,None,None,SA17A,751678
1001730,C00500587,P20003281,"Perry, Rick","ANDERSON, MARILEE MRS.",INFO REQUESTED,XX,99999,INFORMATION REQUESTED PER BEST EFFORTS,INFORMATION REQUESTED PER BEST EFFORTS,2500.0,31-AUG-11,None,None,None,SA17A,751678

### Leitura de arquivos do Microsoft Excel

In [87]:
xlsx = pd.ExcelFile("examples/ex1.xlsx")

In [88]:
xlsx.sheet_names

['Sheet1']

In [89]:
xlsx.parse(sheet_name="Sheet1")

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [90]:
xlsx.parse(sheet_name="Sheet1", index_col=0)

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [91]:
frame = pd.read_excel("examples/ex1.xlsx", sheet_name="Sheet1")

In [92]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [93]:
writer = pd.ExcelWriter("examples/ex2.xlsx")

In [94]:
frame.to_excel(writer, sheet_name="Sheet1")

In [95]:
writer.close()

# Alternativa para salvar o arquivo
# with pd.ExcelWriter("examples/ex2.xlsx") as writer:
#     frame.to_excel(writer, sheet_name="Sheet1")

In [96]:
frame.to_excel("examples/ex2.xlsx")

### Uso do formato HDF5

In [97]:
frame = pd.DataFrame({"a": np.random.standard_normal(100)})

In [98]:
store = pd.HDFStore("examples/mydata.h5")

In [ ]:
store["obj1"] = frame

In [100]:
store["obj1_col"] = frame["a"]

In [ ]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: examples/mydata.h5

In [ ]:
store["obj1"]

           a
0  -0.882736
1   0.505957
2  -0.591599
3  -0.958639
4   1.336590
..       ...
95 -0.612188
96  1.933219
97  0.232227
98  0.908459
99  2.441965

[100 rows x 1 columns]

In [104]:
store.put("obj2", frame, format="table")

In [105]:
store.select("obj2", where=["index >= 10 and index <= 15"])

           a
10 -0.578324
11 -0.238250
12 -1.138060
13 -2.343708
14  1.497456
15  0.294857

In [ ]:
store.close()

In [107]:
frame.to_hdf("examples/mydata.h5", "obj3", format="table")

C:\Users\derek\AppData\Local\Temp\ipykernel_17496\1277131479.py:1: FutureWarning: Starting with pandas version 3.0 all arguments of to_hdf except for the argument 'path_or_buf' will be keyword-only.
  frame.to_hdf("examples/mydata.h5", "obj3", format="table")

In [108]:
pd.read_hdf("examples/mydata.h5", "obj3", where=["index < 5"])

          a
0 -0.882736
1  0.505957
2 -0.591599
3 -0.958639
4  1.336590

## 6.3 Interação com web APIs

In [ ]:
import requests

In [110]:
url = "https://api.github.com/repos/pandas-dev/pandas/issues"

In [111]:
resp = requests.get(url)

In [ ]:
resp.raise_for_status()

In [ ]:
resp

In [ ]:
data = resp.json()

In [115]:
data[0]["title"]

'[backport 2.3.x] DOC: move and reword whatsnew note for replace fix (GH-57865) (#62153)'

In [116]:
issues = pd.DataFrame(data, columns=["number", "title", "labels", "state"])

In [ ]:
issues

,number,title,labels,state
0,62156,[backport 2.3.x] DOC: move and reword whatsnew...,[],open
1,62155,REF: remove unnecessary string mixins,[],open
2,62154,BUG: resampling with origin=end_date includes ...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
3,62152,DOC: prepare 2.3.2 whatsnew notes for release,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
4,62150,BUG: Inconsistent behaviour when merging reset...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
...,...,...,...,...
25,62111,BUG: to_csv uses inconsistent microsecond form...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
26,62110,CI: Always install pandas in non-editable mode...,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
27,62109,BUG: `pd.api.types.is_string_dtype()` returns ...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
28,62108,DOC: Website should copy code only,[],open
29,62103,ENH: Introduce `pandas.col`,[],open

## 6.4 Interação com bancos de dados

In [ ]:
import sqlite3

In [ ]:
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
c REAL, d INTEGER
);
"""

In [ ]:
con = sqlite3.connect("mydata.sqlite")

In [121]:
con.execute(query)

In [ ]:
con.commit()

In [123]:
data = [
    ("Atlanta", "Georgia", 1.25, 6),
    ("Tallahasse", "Florida", 2.6, 3),
    ("Sacramento", "California", 1.7, 5),
]

In [124]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [125]:
con.executemany(stmt, data)

In [ ]:
con.commit()

In [127]:
cursor = con.execute("SELECT * FROM test")

In [ ]:
rows = cursor.fetchall()

In [ ]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahasse', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [ ]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [131]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

            a           b     c  d
0     Atlanta     Georgia  1.25  6
1  Tallahasse     Florida  2.60  3
2  Sacramento  California  1.70  5

In [ ]:
import sqlalchemy as sqla

In [133]:
db = sqla.create_engine("sqlite:///mydata.sqlite")

In [134]:
pd.read_sql("SELECT * FROM test", db)

            a           b     c  d
0     Atlanta     Georgia  1.25  6
1  Tallahasse     Florida  2.60  3
2  Sacramento  California  1.70  5